{
  "metadata": {
    "version": "2.0",
    "created": "2026-01-16",
    "updated": "2026-01-18",
    "author": "Claude (Opus Web)",
    "purpose": "ATLAS voice assistant comprehensive exercise form library",
    "personality": "Lethal Gentleman - direct, efficient, no-nonsense coaching with dry wit",
    "context": {
      "user_injuries": ["Grade 1 rotator cuff tear (suspected)", "Ankle recovery"],
      "equipment": "Home gym - dumbbells, kettlebells, bench, resistance bands, foam roller",
      "training_phase": "Phase 1 Foundation & Rehab"
    },
    "usage_notes": {
      "voice_response": "Keep responses concise for voice. Setup plus 2-3 key cues plus main mistake.",
      "pain_rule": "ALL exercises: if pain greater than 3 out of 10, stop and modify or skip.",
      "tempo_default": "Controlled movement always. Rushing is for amateurs."
    }
  },

  "exercises": {

    "goblet_squat": {
      "name": "Goblet Squat",
      "aliases": ["goblet", "goblet squat", "kb squat", "dumbbell squat"],
      "category": "lower_body",
      "movement_pattern": "squat",
      "equipment": ["dumbbell", "kettlebell"],
      "muscles_primary": ["quadriceps", "glutes"],
      "muscles_secondary": ["core", "upper_back", "hamstrings", "adductors"],

      "setup": "Hold weight at chest height with elbows tucked. Feet shoulder-width or slightly wider, toes turned out 15-30 degrees.",

      "execution": [
        "Big breath into belly, brace core like you're about to get punched.",
        "Break at hips AND knees together. Don't just push hips back.",
        "Push knees out in same direction as toes, don't let them cave.",
        "Lower until thighs parallel or just below. Elbows between knees at bottom.",
        "Drive through whole foot to stand, squeeze glutes at top."
      ],

      "cues": [
        "Spread the floor with your feet. Creates hip tension.",
        "Proud chest, weight stays glued to sternum.",
        "Sit down between your legs, not back behind them.",
        "Think about pushing the floor away as you stand."
      ],

      "common_mistakes": [
        {
          "mistake": "Weight shifts to toes or heels rise.",
          "fix": "Drive through whole foot. If mobility is the issue, elevate heels on a 1-inch plate or wedge."
        },
        {
          "mistake": "Knees cave inward.",
          "fix": "Screw feet into floor, actively push knees out. Consider a resistance band above knees as a cue."
        },
        {
          "mistake": "Torso tips forward or lower back rounds.",
          "fix": "Keep chest up, elbows high. Weight acts as counterbalance. Use it."
        }
      ],

      "breathing": "Inhale at top, hold breath and brace during descent, exhale forcefully as you drive up.",

      "modifications": {
        "easier": "Box squat. Sit to a bench or box behind you for depth reference.",
        "harder": "Pause 2-3 seconds at bottom, or add slow 4-second descent.",
        "ankle_friendly": "Elevate heels 1-2 inches on plates or squat wedge."
      },

      "voice_cue_short": "Spread the floor. Knees out. Sit between your legs. Push floor away.",

      "phase1_notes": "Perfect for Phase 1. Teaches squat mechanics with lighter load. Elevate heels if ankle dorsiflexion is limited."
    },

    "split_squat": {
      "name": "Split Squat",
      "aliases": ["split squat", "split", "bulgarian", "bulgarian split squat", "rear foot elevated", "rfess"],
      "category": "lower_body",
      "movement_pattern": "lunge",
      "equipment": ["dumbbells", "kettlebell", "bodyweight"],
      "muscles_primary": ["quadriceps", "glutes"],
      "muscles_secondary": ["hamstrings", "adductors", "core", "hip_flexors"],

      "setup": "Staggered stance, about 2-3 feet between feet. Front foot flat. Rear foot on toes (or elevated on bench for Bulgarian). Hip bones pointing straight ahead like headlights.",

      "execution": [
        "Before you move: Exhale and tuck your pelvis slightly. Squeeze the BACK leg's glute.",
        "Drop straight DOWN like an elevator. Don't lunge forward.",
        "80% of weight stays through front foot. Back knee drops toward floor.",
        "Feel the stretch in your BACK hip flexor as you descend.",
        "Drive through front heel to stand. Squeeze front glute at top."
      ],

      "cues": [
        "BACK GLUTE SQUEEZE opens the hip flexor. This is the secret cue.",
        "Front knee tracks over toes. Push it OUT, not in.",
        "Ribs down, chest up. Get ribs down FIRST, then lift chest.",
        "Front shin stays vertical. If knee drifts forward, step back leg further."
      ],

      "common_mistakes": [
        {
          "mistake": "Missing the hip flexor stretch entirely.",
          "fix": "Squeeze the back glute AND tuck pelvis slightly. You should feel stretch in front of back hip."
        },
        {
          "mistake": "Leaning torso forward.",
          "fix": "Ribs down, stay tall. Think elevator going DOWN, not forward."
        },
        {
          "mistake": "Back knee collapsing inward (varus).",
          "fix": "Usually tight hip flexors. Squeeze back glute harder and focus on hip flexor opening."
        },
        {
          "mistake": "Front knee caving inward.",
          "fix": "Screw front foot into floor. Actively push knee out over pinky toe."
        }
      ],

      "breathing": "Inhale as you lower. Exhale as you drive up.",

      "modifications": {
        "easier": "Use support (wall, stick) until strength and flexibility improve. Reduce depth.",
        "harder": "Elevate rear foot on bench for Bulgarian split squat. Add pause at bottom.",
        "ankle_friendly": "Elevate front heel on small plate if ankle mobility limited."
      },

      "voice_cue_short": "Squeeze back glute. Drop straight down. Feel hip flexor stretch.",

      "phase1_notes": "This exercise SHOULD stretch your back hip flexor if done correctly. If you don't feel that stretch, squeeze the back glute harder and tuck pelvis."
    },

    "rdl": {
      "name": "Romanian Deadlift",
      "aliases": ["rdl", "romanian deadlift", "romanian", "db rdl", "dumbbell rdl"],
      "category": "lower_body",
      "movement_pattern": "hip_hinge",
      "equipment": ["dumbbells", "kettlebell", "barbell"],
      "muscles_primary": ["hamstrings", "glutes"],
      "muscles_secondary": ["lower_back", "upper_back", "core", "grip"],

      "setup": "Stand tall, feet hip-width, weights held at thighs. Slight bend in knees that STAYS FIXED throughout.",

      "execution": [
        "Unlock knees slightly. This angle doesn't change during the lift.",
        "Initiate by pushing hips BACK, not by bending forward.",
        "Let weights slide down thighs. Keep them close.",
        "Lower until you feel strong hamstring stretch. Stop before back rounds.",
        "Drive hips forward to stand, squeeze glutes hard at top."
      ],

      "cues": [
        "Imagine closing a car door with your arse.",
        "Hips back like someone's pulling you by a belt.",
        "Weights paint your thighs. Never lose contact.",
        "Neutral spine is non-negotiable. Stop when it wants to round."
      ],

      "common_mistakes": [
        {
          "mistake": "Turning it into a squat. Bending knees too much.",
          "fix": "Set slight knee bend at start and FREEZE it. The movement is a hip hinge, not a squat."
        },
        {
          "mistake": "Rounding lower back to get more range.",
          "fix": "Your range is determined by hamstring flexibility. Stop when spine wants to flex."
        },
        {
          "mistake": "Weights drift away from body.",
          "fix": "Engage lats, pull weights into thighs. Think about bending the bar around your legs."
        }
      ],

      "breathing": "Breath in at top, brace core, hold during descent, exhale as you drive hips forward.",

      "modifications": {
        "easier": "Use blocks or plates as targets. Tap them at bottom for feedback.",
        "harder": "Slow 4-second descent, 2-second pause at bottom stretch.",
        "single_leg": "Single-leg RDL for balance and asymmetry correction."
      },

      "voice_cue_short": "Hips BACK. Knees stay soft. Weights hug thighs. Stop when back wants to round.",

      "phase1_notes": "Essential hip hinge pattern. Use tempo to ingrain proper mechanics."
    },

    "floor_press": {
      "name": "Dumbbell Floor Press",
      "aliases": ["floor press", "db floor press", "chest press", "dumbbell press"],
      "category": "upper_body",
      "movement_pattern": "horizontal_push",
      "equipment": ["dumbbells"],
      "muscles_primary": ["chest", "triceps"],
      "muscles_secondary": ["anterior_deltoids", "core"],

      "setup": "Lie on back, knees bent, feet flat. Dumbbells at chest height, elbows on floor at 45-degree angle to torso. NOT flared at 90 degrees.",

      "execution": [
        "Squeeze shoulder blades together, press them into floor.",
        "Grip dumbbells tight, wrists neutral. Not bent back.",
        "Press up and slightly in. Weights meet above chest, not face.",
        "Lower with control until upper arms touch floor. Don't bounce.",
        "Brief pause on floor, then press again."
      ],

      "cues": [
        "45-degree elbow angle. Protects your shoulder.",
        "Drive shoulder blades into the floor.",
        "Squeeze glutes and brace core for stability.",
        "Control the descent. Floor is not a trampoline."
      ],

      "common_mistakes": [
        {
          "mistake": "Elbows flared at 90 degrees to body.",
          "fix": "Tuck to 45 degrees. This is shoulder-safe pressing. Critical with your rotator cuff."
        },
        {
          "mistake": "Bouncing elbows off floor.",
          "fix": "Touch floor gently, pause, then press. The pause removes momentum."
        },
        {
          "mistake": "Lower back arched off floor.",
          "fix": "Squeeze glutes, press lower back toward floor."
        }
      ],

      "breathing": "Inhale as you lower, exhale as you press.",

      "modifications": {
        "easier": "Lighter weights, focus on slow negatives.",
        "harder": "3-second pause on floor between reps.",
        "neutral_grip": "Palms facing each other. Even more shoulder friendly."
      },

      "voice_cue_short": "Elbows 45 degrees. Blades into floor. Touch floor gently. Pause. Press.",

      "phase1_notes": "YOUR go-to pressing movement. Floor limits range of motion. Protects shoulder. 45-degree elbows are mandatory with your rotator cuff situation."
    },

    "landmine_press": {
      "name": "Landmine Press",
      "aliases": ["landmine press", "landmine", "single arm press", "single arm landmine", "angled press"],
      "category": "upper_body",
      "movement_pattern": "vertical_push",
      "equipment": ["barbell", "landmine_attachment"],
      "muscles_primary": ["anterior_deltoids", "upper_chest", "triceps"],
      "muscles_secondary": ["core", "serratus_anterior", "obliques"],

      "setup": "Bar in landmine or wedged in corner. Stand facing the end of the bar, one hand gripping the end. Staggered stance. Slight forward lean.",

      "execution": [
        "Start with bar at shoulder height, elbow tucked.",
        "Press up and forward, following the arc of the bar.",
        "Fully extend arm at the top. Don't lock elbow aggressively.",
        "Lower with control back to shoulder.",
        "Complete all reps one side, then switch."
      ],

      "cues": [
        "Keep elbow close to body at bottom. Not flared.",
        "Drive through your legs slightly. Use whole body.",
        "Core stays braced throughout. No excessive arching.",
        "Control the arc. Bar path is diagonal, not straight up."
      ],

      "common_mistakes": [
        {
          "mistake": "Rotating torso excessively.",
          "fix": "Small rotation is fine. Keep hips mostly square."
        },
        {
          "mistake": "Standing too upright.",
          "fix": "Slight forward lean at start. Let the angle work for you."
        },
        {
          "mistake": "Elbow flaring out at bottom.",
          "fix": "Keep elbow close. Protects shoulder."
        }
      ],

      "breathing": "Inhale at bottom, exhale as you press.",

      "modifications": {
        "easier": "Lighter plate, focus on form and control.",
        "harder": "Add slight pause at top. Slower eccentric.",
        "kneeling": "Half-kneeling position increases core demand."
      },

      "phase1_notes": "Good shoulder-safe pressing option. Single arm work corrects asymmetries. The angled bar path is easier on shoulders than straight overhead."
    },

    "chest_supported_row": {
      "name": "Chest-Supported Row",
      "aliases": ["chest supported row", "incline row", "incline dumbbell row", "supported row", "row"],
      "category": "upper_body",
      "movement_pattern": "horizontal_pull",
      "equipment": ["dumbbells", "incline_bench"],
      "muscles_primary": ["lats", "rhomboids", "rear_deltoids"],
      "muscles_secondary": ["biceps", "traps", "forearms"],

      "setup": "Set bench to 30-45 degrees. Lie chest on pad, feet planted firmly. Let arms hang straight down with dumbbells, head neutral looking at floor.",

      "execution": [
        "Keep chest pressed into bench throughout. No lifting up.",
        "Initiate row by driving elbows back and up toward ceiling.",
        "Squeeze shoulder blades together at top. Hold for a beat.",
        "Lower with control. Full arm extension at bottom.",
        "Arms travel at slight angle toward hips, not straight out."
      ],

      "cues": [
        "Elbows lead the way. Think puppeteer pulling strings attached to elbows.",
        "Row to your hips, not your armpits.",
        "Squeeze shoulder blades like you're cracking a walnut between them.",
        "Chest stays glued to bench. If it lifts, weight is too heavy."
      ],

      "common_mistakes": [
        {
          "mistake": "Lifting chest off bench to get more range.",
          "fix": "Keep chest planted. If you need to lift off, the weight is too heavy. Ego down."
        },
        {
          "mistake": "Shrugging shoulders to ears.",
          "fix": "Pull shoulder blades DOWN and BACK. Think about putting them in your back pockets."
        },
        {
          "mistake": "Using momentum or jerking weights.",
          "fix": "Slow and controlled. 2 seconds up, squeeze, 2 seconds down. No exceptions."
        },
        {
          "mistake": "Elbows flaring wide.",
          "fix": "Angle elbows toward hips for lat focus. Wide elbows shift to upper back only."
        }
      ],

      "breathing": "Exhale as you row up, inhale as you lower.",

      "modifications": {
        "wider_grip": "Elbows out wider for more upper back and rear delt focus.",
        "neutral_grip": "Palms facing each other. Easier on elbows.",
        "single_arm": "One arm at a time for asymmetry correction."
      },

      "phase1_notes": "Safe for your shoulder because bench supports you. No strain on rotator cuff from stabilizing. Build your back without aggravating the shoulder."
    },

    "kettlebell_swing": {
      "name": "Kettlebell Swing",
      "aliases": ["kb swing", "kettlebell swing", "swing", "russian swing"],
      "category": "full_body",
      "movement_pattern": "hip_hinge_ballistic",
      "equipment": ["kettlebell"],
      "muscles_primary": ["glutes", "hamstrings", "core"],
      "muscles_secondary": ["lats", "shoulders", "forearms", "lower_back"],

      "setup": "KB on floor about 12 inches ahead. Feet slightly wider than shoulders. Hinge at hips (NOT squat) to grip handle. You should feel hamstrings stretch just gripping it.",

      "execution": [
        "Hike KB back between legs like snapping a football. Wrists hit high inner thighs.",
        "HIP SNAP forward. Imagine someone pulling you by your belt. This powers the swing.",
        "Arms are just ropes - they float up naturally. Chest height max for Russian swing.",
        "At top: standing TALL, glutes squeezed HARD, you're a vertical plank.",
        "Wait for KB to fall, then hinge LATE. Play chicken with your hips."
      ],

      "cues": [
        "HINGE not SQUAT. If your knees bend a lot, you're squatting. Think: butt back, shins vertical.",
        "Arms are ropes with hooks. They don't lift - your hips THROW the bell.",
        "Hip SNAP. Quick, powerful. Like jumping without leaving the ground.",
        "At the top: SQUEEZE glutes to stop the motion. Stand tall, don't lean back."
      ],

      "common_mistakes": [
        {
          "mistake": "Squatting instead of hinging. Knees bending too much.",
          "fix": "Test: Put a foam roller between your feet. If you hit it, you're squatting. Push BUTT BACK, not knees forward."
        },
        {
          "mistake": "Using arms to lift the bell.",
          "fix": "Your arms should feel relaxed. If shoulders burn, hips aren't doing the work. Go HEAVIER - forces proper form."
        },
        {
          "mistake": "Leaning back at the top.",
          "fix": "Stand TALL like a plank. Squeeze glutes to STOP motion, don't hyperextend your spine."
        },
        {
          "mistake": "Hinging too early on the way down (back pain).",
          "fix": "Wait! Bell should almost hit your hips before you hinge back. Late hinge protects your back."
        }
      ],

      "breathing": "Sharp exhale like a punch at top. Inhale on backswing.",

      "voice_cue_short": "Hinge not squat. Hip snap. Glutes squeeze at top.",

      "modifications": {
        "easier": "Dead-stop swings. Set bell down between each rep to reset.",
        "harder": "Single-arm swings, or heavier bell.",
        "towel_swing": "Loop towel through handle. Forces you to use hips, can't cheat with arms."
      },

      "phase1_notes": "Powerful hip hinge pattern. Start with dead-stop single swings until form is locked. Do NOT let ego drive weight selection."
    },

    "plank": {
      "name": "Plank",
      "aliases": ["plank", "forearm plank", "front plank", "prone bridge"],
      "category": "core",
      "movement_pattern": "isometric_anti_extension",
      "equipment": ["none", "mat"],
      "muscles_primary": ["transverse_abdominis", "rectus_abdominis", "obliques"],
      "muscles_secondary": ["glutes", "shoulders", "lats", "quads"],

      "setup": "Forearms on floor, elbows directly under shoulders. Toes tucked, legs straight. Body forms straight line from head to heels.",

      "execution": [
        "Squeeze glutes. This protects lower back.",
        "Brace core like you're about to get punched in the gut.",
        "Push forearms into floor. Creates lat engagement.",
        "Tuck pelvis slightly. Eliminates low back sag.",
        "Eyes on floor, neutral neck. Not looking forward."
      ],

      "cues": [
        "Squeeze your arse. This is non-negotiable.",
        "Think about pulling elbows toward toes. They won't move, but the intent creates tension.",
        "Straight line from ears to ankles. Broomstick test.",
        "Breathe. Don't hold your breath like an idiot."
      ],

      "common_mistakes": [
        {
          "mistake": "Hips sagging toward floor.",
          "fix": "Squeeze glutes harder. If they still sag, you're done. End the set. Quality over quantity."
        },
        {
          "mistake": "Hips piked up. Bum in air.",
          "fix": "You're not doing downward dog. Lower hips until body is straight line."
        },
        {
          "mistake": "Head drooping or looking forward.",
          "fix": "Neutral neck. Look at floor between forearms. Ears in line with shoulders."
        },
        {
          "mistake": "Holding breath.",
          "fix": "Breathe normally. Core should stay braced while breathing. That's the skill you're building."
        }
      ],

      "breathing": "Normal, continuous breathing. Maintain brace while breathing.",

      "modifications": {
        "easier": "From knees, or elevated hands on bench.",
        "harder": "Add arm reaches, leg lifts, or body saw movement.",
        "high_plank": "From hands. More shoulder involvement."
      },

      "duration": {
        "beginner": "20-30 seconds",
        "intermediate": "45-60 seconds",
        "advanced": "60-90 seconds"
      },

      "phase1_notes": "Quality over time. 30 seconds with perfect form beats 2 minutes of garbage form. End set when form breaks."
    },

    "dead_bug": {
      "name": "Dead Bug",
      "aliases": ["dead bug", "deadbug", "supine march"],
      "category": "core",
      "movement_pattern": "anti_extension",
      "equipment": ["none", "mat"],
      "muscles_primary": ["transverse_abdominis", "rectus_abdominis"],
      "muscles_secondary": ["hip_flexors", "obliques"],

      "setup": "Lie on back, arms pointing to ceiling. Legs in tabletop. Hips and knees at 90 degrees. Press lower back INTO floor. No gap.",

      "execution": [
        "Press lower back firmly into floor. This is the key.",
        "Slowly lower opposite arm and leg toward floor.",
        "Arm goes overhead, leg extends straight out.",
        "Stop BEFORE lower back lifts off floor.",
        "Return to start with control, switch sides."
      ],

      "cues": [
        "Flatten your lower back into the mat. Imagine you're squashing a blueberry.",
        "Move slow. This isn't a race.",
        "If back lifts off floor, you've gone too far.",
        "Think about resisting your limbs moving. Not just moving them."
      ],

      "common_mistakes": [
        {
          "mistake": "Lower back arches off floor.",
          "fix": "Reduce range of motion. Only go as far as you can while keeping back flat. That's your working range."
        },
        {
          "mistake": "Moving too fast.",
          "fix": "2-3 seconds each direction. Control is the point. Speed kills the benefit."
        },
        {
          "mistake": "Holding breath.",
          "fix": "Exhale as you extend limbs, inhale as you return. Breathing while bracing is the skill."
        },
        {
          "mistake": "Extending same-side arm and leg.",
          "fix": "OPPOSITE arm and leg. Right arm with left leg. Cross-body pattern."
        }
      ],

      "breathing": "Exhale as limbs extend away, inhale as they return.",

      "modifications": {
        "easier": "Move only legs while arms stay up, or only arms while legs stay in tabletop.",
        "harder": "Hold light dumbbells, or add resistance band around feet.",
        "stability_ball": "Press ball between one knee and one hand. Maintains tension."
      },

      "phase1_notes": "Foundation exercise. Teaches core bracing while limbs move. Exactly what you need for all other lifts. Do this daily as warmup."
    },

    "bird_dog": {
      "name": "Bird Dog",
      "aliases": ["bird dog", "birddog", "quadruped", "contralateral reach"],
      "category": "core",
      "movement_pattern": "anti_rotation",
      "equipment": ["none", "mat"],
      "muscles_primary": ["erector_spinae", "multifidus", "glutes"],
      "muscles_secondary": ["transverse_abdominis", "deltoids", "hamstrings"],

      "setup": "Hands and knees position. Hands under shoulders, knees under hips. Flat back. Spine neutral. Eyes looking at floor.",

      "execution": [
        "Engage core and squeeze glutes before moving.",
        "Slowly extend opposite arm and leg simultaneously.",
        "Reach arm forward, leg back. Both parallel to floor.",
        "Hold for 1-2 seconds at full extension.",
        "Return with control, switch sides."
      ],

      "cues": [
        "Imagine balancing a glass of water on your lower back. Don't let it spill.",
        "Reach LONG. Arm forward, leg back, like someone's stretching you.",
        "Hips and shoulders stay SQUARE. No rotation.",
        "Squeeze glute of extending leg HARD."
      ],

      "common_mistakes": [
        {
          "mistake": "Lower back sags or arches.",
          "fix": "Engage core BEFORE moving limbs. If back moves, range of motion is too big."
        },
        {
          "mistake": "Hip rotates or opens to side.",
          "fix": "Keep knee of extending leg pointing DOWN at floor. Don't let it rotate outward."
        },
        {
          "mistake": "Rushing through reps.",
          "fix": "Slow and controlled. 2 seconds out, hold, 2 seconds back. This builds control, not cardio."
        },
        {
          "mistake": "Head lifting up.",
          "fix": "Eyes on floor. Neutral neck in line with spine. Not looking at the wall ahead."
        }
      ],

      "breathing": "Exhale as you extend, inhale as you return.",

      "modifications": {
        "easier": "Move only arm OR only leg. Not both together.",
        "harder": "Add 3-second hold at top, or loop resistance band around feet.",
        "elevated": "Hands on bench for more challenge to stability."
      },

      "voice_cue_short": "Glass of water on back. Reach long. No rotation. Squeeze glute.",

      "phase1_notes": "McGill Big 3. Anti-rotation exercise - hips and shoulders stay square. Test yourself: could you balance a water glass on your lower back without spilling?"
    },

    "glute_bridge": {
      "name": "Glute Bridge",
      "aliases": ["glute bridge", "bridge", "hip bridge", "glute raise"],
      "category": "lower_body",
      "movement_pattern": "hip_extension",
      "equipment": ["none", "mat"],
      "muscles_primary": ["glutes", "hamstrings"],
      "muscles_secondary": ["core", "lower_back"],

      "setup": "Lie on back, knees bent, feet flat on floor hip-width apart. Feet close enough that fingertips can touch heels. Arms at sides, palms down.",

      "execution": [
        "Push through heels. Not toes.",
        "Squeeze glutes to lift hips off floor.",
        "Lift until body forms straight line from knees to shoulders.",
        "Squeeze glutes HARD at top. 1 second hold.",
        "Lower with control. Don't just drop."
      ],

      "cues": [
        "Drive through heels. Toes can even lift slightly.",
        "Squeeze glutes like you're pinching a coin between your cheeks.",
        "Straight line from knees to shoulders. No excessive arch.",
        "Don't push through lower back. Push through glutes."
      ],

      "common_mistakes": [
        {
          "mistake": "Pushing through toes instead of heels.",
          "fix": "Lift toes off floor slightly if needed. Heel drive activates glutes properly."
        },
        {
          "mistake": "Hyperextending lower back at top.",
          "fix": "Stop when body is straight line. If you feel it in lower back, you've gone too high."
        },
        {
          "mistake": "Not squeezing glutes at top.",
          "fix": "The squeeze is the point. Without it, hamstrings take over. Squeeze like your life depends on it."
        },
        {
          "mistake": "Feet too far from bum.",
          "fix": "Bring feet closer. Should be able to touch heels with fingertips from starting position."
        }
      ],

      "breathing": "Exhale as you lift, inhale as you lower.",

      "modifications": {
        "easier": "Smaller range of motion, feet wider.",
        "harder": "Single leg, or add band around knees, or add weight on hips.",
        "march": "At top, march knees up alternating. Adds stability challenge."
      },

      "phase1_notes": "Perfect warmup exercise. Activates glutes before squats, deadlifts, and any lower body work. Do 10-15 in every warmup."
    },

    "cat_cow": {
      "name": "Cat-Cow",
      "aliases": ["cat cow", "cat-cow", "catcow", "spinal waves"],
      "category": "mobility",
      "movement_pattern": "spinal_flexion_extension",
      "equipment": ["none", "mat"],
      "muscles_primary": ["erector_spinae", "rectus_abdominis"],
      "muscles_secondary": ["hip_flexors", "neck_muscles", "shoulders"],

      "setup": "Hands and knees. Hands under shoulders, knees under hips. Start with neutral spine.",

      "execution": [
        "COW: Inhale, drop belly toward floor, lift tailbone and chest, eyes forward.",
        "Initiate from pelvis. Tailbone tilts up first, then wave travels up spine.",
        "CAT: Exhale, round spine toward ceiling, tuck tailbone, chin to chest.",
        "Again, initiate from pelvis. Tailbone tucks first, then wave up spine.",
        "Move slowly between positions. Feel each vertebra."
      ],

      "cues": [
        "Move from the pelvis first. Let the wave travel up.",
        "Slow and controlled. This isn't a race.",
        "Feel each segment of your spine moving.",
        "Don't force end ranges. Go only where comfortable."
      ],

      "common_mistakes": [
        {
          "mistake": "Moving too fast.",
          "fix": "3-4 seconds each direction. The slow movement is what mobilizes the spine."
        },
        {
          "mistake": "Only moving at waist or lower back.",
          "fix": "Move through entire spine. From tailbone to skull. Include neck in the movement."
        },
        {
          "mistake": "Holding breath.",
          "fix": "Inhale to cow when belly drops, exhale to cat when back rounds. Breath drives movement."
        },
        {
          "mistake": "Pushing through pain.",
          "fix": "If any position hurts, reduce range. Only move through pain-free range."
        }
      ],

      "breathing": "Inhale for cow which is the arch, exhale for cat which is the round.",

      "modifications": {
        "seated": "Can do in chair. Hands on thighs, same spinal movement.",
        "standing": "Hands on wall. Similar movement pattern."
      },

      "phase1_notes": "Do 10 reps every morning and before every workout. Wakes up the spine, prepares it for movement. Non-negotiable daily mobility."
    },

    "worlds_greatest_stretch": {
      "name": "World's Greatest Stretch",
      "aliases": ["worlds greatest stretch", "wgs", "greatest stretch", "lunge with rotation"],
      "category": "mobility",
      "movement_pattern": "multi_joint_dynamic",
      "equipment": ["none", "mat"],
      "muscles_primary": ["hip_flexors", "hamstrings", "thoracic_spine"],
      "muscles_secondary": ["glutes", "adductors", "chest", "shoulders"],

      "setup": "Start in high plank position or standing.",

      "execution": [
        "Step right foot outside right hand into deep lunge.",
        "Left knee can rest on floor for support if needed.",
        "Place left hand firmly on floor for stability.",
        "Rotate torso to right, reach right arm to ceiling.",
        "Eyes follow right hand. Feel thoracic rotation.",
        "Return hand to floor, step back to plank, switch sides."
      ],

      "cues": [
        "Front knee tracks over ankle. Not past toes.",
        "Twist comes from mid-back which is the thoracic, not lower back.",
        "Keep back leg active. Don't just let it hang there.",
        "Really reach for the ceiling. Maximize rotation."
      ],

      "common_mistakes": [
        {
          "mistake": "Front knee collapsing inward.",
          "fix": "Push knee OUT toward pinky toe side. Engages glutes and protects knee."
        },
        {
          "mistake": "Rushing through it.",
          "fix": "3-5 seconds per position. This is a stretch, not cardio. Slow wins."
        },
        {
          "mistake": "Twisting from lower back.",
          "fix": "Lower back stays stable. Rotation comes from upper back. Think about opening chest to sky."
        },
        {
          "mistake": "Not opening hip enough.",
          "fix": "Drop back hip down and forward. That's where the hip flexor stretch comes from."
        }
      ],

      "breathing": "Exhale as you rotate up, inhale as you return.",

      "modifications": {
        "easier": "Back knee down on mat, use yoga block under hand.",
        "add_hamstring": "After rotation, rock back and straighten front leg. Stretch hamstring."
      },

      "phase1_notes": "If you only do ONE warmup stretch, this is it. Hits ankles, hips, thoracic spine all at once. 5 per side before every workout."
    },

    "band_pull_apart": {
      "name": "Band Pull-Apart",
      "aliases": ["band pull apart", "pull apart", "band pulls"],
      "category": "shoulder_rehab",
      "movement_pattern": "horizontal_abduction",
      "equipment": ["resistance_band"],
      "muscles_primary": ["rear_deltoids", "rhomboids"],
      "muscles_secondary": ["traps", "rotator_cuff"],

      "setup": "Stand tall, hold band in front at shoulder height. Arms straight, palms down, band taut but not stretched.",

      "execution": [
        "Keep arms straight throughout.",
        "Pull band apart by squeezing shoulder blades together.",
        "Drive hands out to sides until band touches chest.",
        "Squeeze shoulder blades HARD at end position. 1 second hold.",
        "Return slowly with control. Don't let band snap back."
      ],

      "cues": [
        "Pull with your back, not your arms. Elbows stay straight.",
        "Shoulder blades go DOWN and BACK. Not UP toward ears.",
        "Control the return. Eccentric is half the exercise.",
        "Think about trying to touch your shoulder blades together."
      ],

      "common_mistakes": [
        {
          "mistake": "Bending elbows to cheat.",
          "fix": "Lock elbows straight. If you can't complete rep, use lighter band."
        },
        {
          "mistake": "Shrugging shoulders up.",
          "fix": "Actively depress shoulders DOWN before pulling. Shoulders stay away from ears."
        },
        {
          "mistake": "Letting band snap back.",
          "fix": "Control the return. Eccentric strengthening is crucial for shoulder health."
        }
      ],

      "breathing": "Exhale as you pull apart, inhale as you return.",

      "modifications": {
        "easier": "Lighter band, smaller range of motion.",
        "higher": "Pull to face level for upper traps emphasis.",
        "lower": "Pull to belly level for different angle."
      },

      "phase1_notes": "CRITICAL for your shoulder rehab. 15-20 reps in warmup, 20 reps in shoulder rehab block. Builds posterior shoulder strength that counteracts internal rotation dominance."
    },

    "face_pull": {
      "name": "Face Pull",
      "aliases": ["face pull", "face pulls", "high pull"],
      "category": "shoulder_rehab",
      "movement_pattern": "horizontal_pull_external_rotation",
      "equipment": ["resistance_band", "cable"],
      "muscles_primary": ["rear_deltoids", "external_rotators"],
      "muscles_secondary": ["traps", "rhomboids"],

      "setup": "Band attached at face height using door anchor or pull-up bar. Hold ends with overhand grip, arms extended, palms facing down.",

      "execution": [
        "Pull band toward face. Elbows go high and wide.",
        "As you pull, rotate hands outward. Finish with thumbs pointing back.",
        "End position: hands beside ears, elbows high, external rotation.",
        "Squeeze shoulder blades together at end. Hold 1 second.",
        "Return with control."
      ],

      "cues": [
        "Pull to your ears, not your chin.",
        "Elbows stay HIGH. Above wrist level.",
        "End with external rotation. Thumbs pointing behind you.",
        "Don't lean back to cheat. Stay tall."
      ],

      "common_mistakes": [
        {
          "mistake": "Pulling to chin or chest level.",
          "fix": "Pull to EAR level. This is what hits the external rotators."
        },
        {
          "mistake": "No external rotation at end.",
          "fix": "Rotate hands back at top. Like you're doing a double bicep pose. This is the money position."
        },
        {
          "mistake": "Leaning back to complete rep.",
          "fix": "Stay vertical. If you need to lean, use lighter band."
        }
      ],

      "breathing": "Exhale as you pull, inhale as you return.",

      "phase1_notes": "Essential for rotator cuff health. The external rotation at top specifically targets the muscles you need to rehab. Do these 3x weekly minimum. THE HEALER exercise."
    },

    "side_lying_external_rotation": {
      "name": "Side-Lying External Rotation",
      "aliases": ["side lying external rotation", "sidelying ER", "external rotation", "the healer"],
      "category": "shoulder_rehab",
      "movement_pattern": "external_rotation",
      "equipment": ["light_dumbbell", "resistance_band"],
      "muscles_primary": ["infraspinatus", "teres_minor"],
      "muscles_secondary": ["posterior_deltoid"],

      "setup": "Lie on uninvolved side. Involved arm on top, elbow bent 90 degrees, elbow pinned to side with rolled towel if needed.",

      "execution": [
        "Keep elbow PINNED to side throughout.",
        "Rotate forearm UP toward ceiling. External rotation.",
        "Go only as high as comfortable. Don't force.",
        "SLOW 4-second lowering which is the eccentric. This is where the magic happens.",
        "Return to start, repeat."
      ],

      "cues": [
        "Elbow stays glued to your side. It doesn't move.",
        "The SLOW lowering is the rehab. Don't drop it fast.",
        "Pain-free range only. Stop before pain starts.",
        "Think about your forearm as a door hinge rotating on your elbow."
      ],

      "common_mistakes": [
        {
          "mistake": "Elbow drifting away from body.",
          "fix": "Put rolled towel under elbow. Keeps it in correct position."
        },
        {
          "mistake": "Going too heavy.",
          "fix": "This is rehab, not strength training. 1-2kg max. Control beats load."
        },
        {
          "mistake": "Fast lowering phase.",
          "fix": "4-second eccentric minimum. The slow lowering is what heals the tendon."
        },
        {
          "mistake": "Pushing through pain.",
          "fix": "STOP before pain. Work in pain-free range. Painful rehab is counterproductive."
        }
      ],

      "breathing": "Normal breathing throughout.",

      "phase1_notes": "THE exercise for rotator cuff rehab. Eccentric loading is proven for tendon healing. 3 sets of 10-15 daily. Very light weight. 1-2kg. Slow 4-second lowering."
    },

    "doorframe_external_rotation": {
      "name": "Doorframe External Rotation Isometric",
      "aliases": ["doorframe ER", "isometric ER", "shoulder painkiller", "doorframe hold"],
      "category": "shoulder_rehab",
      "movement_pattern": "isometric_external_rotation",
      "equipment": ["doorframe"],
      "muscles_primary": ["infraspinatus", "teres_minor"],
      "muscles_secondary": ["posterior_deltoid"],

      "setup": "Stand INSIDE doorframe facing out. Arm at your side, elbow bent 90 degrees so forearm points forward. Position the BACK of your wrist/hand (knuckle side) against the inside of the doorframe. Your palm faces inward toward your body. The doorframe blocks your hand from rotating outward.",

      "execution": [
        "Try to rotate your forearm outward (like opening a door). The doorframe stops the movement.",
        "Push the back of your hand into the doorframe. Gentle sustained push, 30-50% effort.",
        "Elbow stays pinned to your side the entire time. Don't let it drift forward or outward.",
        "Hold this push for 45 seconds.",
        "Breathe normally throughout. Don't hold breath.",
        "Release, rest 15-30 seconds, repeat for second hold."
      ],

      "cues": [
        "Gentle push. Not maximum effort.",
        "No pain. If it hurts, reduce force.",
        "Elbow stays glued to side.",
        "Keep breathing. Don't hold breath."
      ],

      "common_mistakes": [
        {
          "mistake": "Pushing too hard.",
          "fix": "Submaximal effort only. This is activation and neural drive, not strength test."
        },
        {
          "mistake": "Elbow drifting out.",
          "fix": "Keep elbow pinned to side. Put towel under elbow if needed."
        },
        {
          "mistake": "Holding breath.",
          "fix": "Normal breathing. Breath holding spikes blood pressure unnecessarily."
        }
      ],

      "breathing": "Normal, continuous breathing.",

      "duration": "45 seconds per hold, 2 holds per session.",

      "phase1_notes": "Pain-killing isometric. Do BEFORE workouts to wake up rotator cuff. Also good when shoulder is cranky. Activates the muscles without aggravating tendon."
    },

    "towel_crush": {
      "name": "Towel Crush",
      "aliases": ["towel crush", "towel squeeze", "shoulder squeeze"],
      "category": "shoulder_rehab",
      "movement_pattern": "isometric_adduction",
      "equipment": ["rolled_towel"],
      "muscles_primary": ["pectorals", "anterior_deltoid"],
      "muscles_secondary": ["serratus_anterior"],

      "setup": "Stand or sit. Roll small towel. Place between elbow and side body. Arm at side, elbow bent 90 degrees.",

      "execution": [
        "Squeeze elbow into towel and body. Adduction force.",
        "Hold for 10 seconds.",
        "Release, rest 2-3 seconds.",
        "Repeat 5 times."
      ],

      "cues": [
        "Moderate squeeze. Not maximum effort.",
        "Should feel front of shoulder working.",
        "No pain. If painful, reduce force."
      ],

      "common_mistakes": [
        {
          "mistake": "Squeezing too hard.",
          "fix": "50% effort max. This is activation, not strength training."
        }
      ],

      "breathing": "Normal breathing.",

      "duration": "10 seconds per squeeze, 5 squeezes per set.",

      "phase1_notes": "Pairs with doorframe ER. Activates anterior shoulder to balance the posterior work. Part of your shoulder rehab block."
    },

    "scapular_wall_slide": {
      "name": "Scapular Wall Slide",
      "aliases": ["wall slide", "wall angel", "scapular slide"],
      "category": "shoulder_rehab",
      "movement_pattern": "scapular_elevation_depression",
      "equipment": ["wall"],
      "muscles_primary": ["serratus_anterior", "lower_traps"],
      "muscles_secondary": ["rhomboids", "rotator_cuff"],

      "setup": "Stand with back flat against wall. Feet few inches from wall. Arms at sides, elbows and backs of hands against wall.",

      "execution": [
        "Slide arms up wall. Keep elbows and hands touching wall.",
        "Go as high as you can while maintaining wall contact.",
        "At top, push hands INTO wall slightly. Activates serratus.",
        "Slide back down with control.",
        "Keep entire back flat against wall throughout."
      ],

      "cues": [
        "Elbows AND hands stay on wall. Both points of contact.",
        "If something comes off wall, that's your current range limit.",
        "Slight push into wall at top. Serratus activation.",
        "Core stays braced. No arching away from wall."
      ],

      "common_mistakes": [
        {
          "mistake": "Lower back arching off wall.",
          "fix": "Brace core, flatten lower back into wall. If arch happens, reduce range."
        },
        {
          "mistake": "Elbows or hands losing wall contact.",
          "fix": "That's your limit. Only go as high as you can maintain contact."
        },
        {
          "mistake": "Shrugging shoulders to get higher.",
          "fix": "Keep shoulders DOWN. Range is limited. That's fine. Don't compensate."
        }
      ],

      "breathing": "Exhale as you slide up, inhale as you slide down.",

      "phase1_notes": "Teaches proper scapular mechanics. Critical for shoulder health. If you can't do this clean, your shoulder blade isn't moving properly."
    },

    "hip_flexor_stretch": {
      "name": "Hip Flexor Stretch",
      "aliases": ["hip flexor stretch", "kneeling hip flexor", "couch stretch", "psoas stretch"],
      "category": "mobility",
      "movement_pattern": "static_stretch",
      "equipment": ["mat", "optional_couch"],
      "muscles_primary": ["psoas", "rectus_femoris"],
      "muscles_secondary": ["quadriceps", "TFL"],

      "setup": "Half-kneeling position. Back knee on pad, front foot flat on floor. Torso upright.",

      "execution": [
        "Tuck pelvis UNDER. Posterior pelvic tilt.",
        "Squeeze glute of back leg HARD.",
        "Shift weight gently forward while maintaining tuck.",
        "You should feel stretch in front of back hip.",
        "Hold for 60 seconds minimum."
      ],

      "cues": [
        "Tuck tailbone UNDER. This is what unlocks the stretch.",
        "If you don't squeeze glute, you're not stretching hip flexor properly.",
        "Don't lean forward at waist. Stay upright.",
        "Stretch is in FRONT of hip, not lower back."
      ],

      "common_mistakes": [
        {
          "mistake": "Arching lower back to feel stretch.",
          "fix": "That's lower back extension, not hip flexor stretch. Tuck pelvis, squeeze glute."
        },
        {
          "mistake": "Leaning torso forward.",
          "fix": "Stay upright. Lean is cheating. Reduces stretch on hip flexor."
        },
        {
          "mistake": "Not squeezing glute.",
          "fix": "Glute squeeze is mandatory. It's what creates reciprocal inhibition of the hip flexor."
        }
      ],

      "breathing": "Deep, relaxed breathing. No breath holding.",

      "modifications": {
        "couch_stretch": "Back foot elevated on couch or wall behind you. More intense.",
        "standing": "Modified lunge position if kneeling is uncomfortable."
      },

      "duration": "60 seconds per side minimum.",

      "phase1_notes": "Tight hip flexors are probably contributing to your issues. 60 seconds per side daily. Do in rehab block AND cooldown."
    },

    "single_leg_balance": {
      "name": "Single Leg Balance",
      "aliases": ["single leg balance", "balance", "one leg stand", "proprioception"],
      "category": "balance",
      "movement_pattern": "stability",
      "equipment": ["none"],
      "muscles_primary": ["ankle_stabilizers", "glute_medius", "core"],
      "muscles_secondary": ["hip_stabilizers", "quadriceps", "calves"],

      "setup": "Train BAREFOOT for best proprioception. Stand tall, lift one foot. Head back, chin tucked, shoulders down and back. Fix eyes on a point ahead.",

      "execution": [
        "Start with standing foot pointing straight ahead. Arms out for balance if needed.",
        "Soft bend in standing knee - NOT locked out.",
        "Squeeze the glute of your standing leg. This stabilizes the hip.",
        "Notice your big toe and ball of foot. They should stay glued to floor.",
        "Find stillness. Minimize wobbles. Breathe normally."
      ],

      "cues": [
        "TRIPOD FOOT: Press through heel, ball of big toe, ball of little toe equally.",
        "Standing knee soft, not locked. Tracks over middle toes.",
        "Level hips - don't let lifted-leg hip drop.",
        "Big toe should be ACTIVE. If it keeps lifting, you're weak there."
      ],

      "common_mistakes": [
        {
          "mistake": "Knee locked straight.",
          "fix": "Soft bend always. Locked knee reduces ankle and hip feedback."
        },
        {
          "mistake": "Hip drops on lifted-leg side.",
          "fix": "Squeeze standing-leg glute harder. Keep pelvis level like a table."
        },
        {
          "mistake": "Weight shifts to outside of foot or big toe lifts.",
          "fix": "Actively press big toe down. Weight should spread across whole foot."
        },
        {
          "mistake": "Holding breath.",
          "fix": "Breathe steadily. Holding breath makes balance harder, not easier."
        }
      ],

      "progression": {
        "level_1": "Eyes open, firm floor. Goal: 60 seconds. GATE 1 requirement.",
        "level_2": "Eyes closed, firm floor. Goal: 30 seconds. GATE 1 requirement.",
        "level_3": "Eyes open, pillow or foam pad under foot.",
        "level_4": "Eyes closed, unstable surface. Advanced."
      },

      "voice_cue_short": "Barefoot. Soft knee. Tripod foot. Squeeze standing glute.",

      "phase1_notes": "GATE 1 REQUIREMENT: 60s eyes open, 30s eyes closed. Train daily. Barefoot gives best feedback. If big toe keeps lifting, your foot intrinsics need work."
    },

    "heel_raises": {
      "name": "Single Leg Heel Raises",
      "aliases": ["heel raise", "calf raise", "single leg calf raise", "ankle strength"],
      "category": "rehab",
      "movement_pattern": "plantar_flexion",
      "equipment": ["none", "step"],
      "muscles_primary": ["gastrocnemius", "soleus"],
      "muscles_secondary": ["tibialis_posterior", "peroneals"],

      "setup": "Stand on one leg, ball of foot on edge of step which is optional. Hand on wall for light balance support only.",

      "execution": [
        "Push through ball of foot to raise heel as high as possible.",
        "Pause at top. Full contraction.",
        "Lower slowly with control. 3-4 seconds.",
        "Go below step level if using step. Full stretch.",
        "Use hand for balance only. Not to push yourself up."
      ],

      "cues": [
        "Push up through big toe, not rolling to outside of foot.",
        "Straight ankle. Don't let it wobble side to side.",
        "Full range of motion. Bottom to top.",
        "Control the eccentric. Lowering builds strength."
      ],

      "common_mistakes": [
        {
          "mistake": "Using hand to pull up.",
          "fix": "Light fingertip touch only. The calf does the work."
        },
        {
          "mistake": "Not going to full height.",
          "fix": "Rise onto tiptoes. Full plantar flexion."
        },
        {
          "mistake": "Dropping down fast.",
          "fix": "Control the lowering. This eccentric portion is crucial for tendon health."
        }
      ],

      "breathing": "Exhale as you rise, inhale as you lower.",

      "phase1_notes": "GATE 1 REQUIREMENT: 25 reps each leg, LSI greater than or equal to 90%. Critical for ankle return to sport."
    },

    "ankle_cars": {
      "name": "Ankle CARs",
      "aliases": ["ankle CARs", "ankle circles", "controlled articular rotations"],
      "category": "mobility",
      "movement_pattern": "joint_circles",
      "equipment": ["none"],
      "muscles_primary": ["ankle_stabilizers"],
      "muscles_secondary": ["calves", "shin_muscles"],

      "setup": "Seated or standing while holding support. Lift one foot off ground.",

      "execution": [
        "Point toes down. Plantar flexion.",
        "Roll foot inward. Inversion.",
        "Pull toes up. Dorsiflexion.",
        "Roll foot outward. Eversion.",
        "Complete full circles. Both directions."
      ],

      "cues": [
        "Make the BIGGEST circle possible.",
        "Move through every degree of the range.",
        "Slow and controlled. No jerky movements.",
        "End range is where the work happens. Push into it gently."
      ],

      "common_mistakes": [
        {
          "mistake": "Small, lazy circles.",
          "fix": "Make them HUGE. Push into end ranges. That's the whole point."
        },
        {
          "mistake": "Moving the whole leg.",
          "fix": "Keep leg still. Only the ankle moves."
        },
        {
          "mistake": "Moving too fast.",
          "fix": "5-10 seconds per full circle. Slow reveals where you're restricted."
        }
      ],

      "breathing": "Normal breathing.",

      "reps": "5 circles each direction, each ankle.",

      "phase1_notes": "Daily ankle maintenance. Restores and maintains full ankle range. Do every morning and before any lower body work."
    },

    "eccentric_calf_raises": {
      "name": "Eccentric Calf Raises",
      "aliases": ["eccentric calf raise", "negative calf raise", "alfredson protocol"],
      "category": "rehab",
      "movement_pattern": "eccentric_plantar_flexion",
      "equipment": ["step"],
      "muscles_primary": ["gastrocnemius", "soleus", "achilles_tendon"],
      "muscles_secondary": ["ankle_stabilizers"],

      "setup": "Stand on step, balls of both feet on edge. Rise up on toes using both legs.",

      "execution": [
        "Rise up on toes using BOTH legs. This is the easy part.",
        "At top, lift one foot off step.",
        "Lower SLOWLY on single leg over 3-5 seconds.",
        "Go below step level. Full stretch on achilles.",
        "Put other foot back down, rise on both, repeat."
      ],

      "cues": [
        "The LOWERING is the exercise. Go slow.",
        "Control through entire range. No dropping.",
        "Full stretch at bottom. Heel below step level.",
        "Rise on two, lower on one."
      ],

      "common_mistakes": [
        {
          "mistake": "Lowering too fast.",
          "fix": "3-5 seconds down. The eccentric loading is the rehab stimulus."
        },
        {
          "mistake": "Not going below step level.",
          "fix": "Full stretch is important. Heel must drop below step."
        },
        {
          "mistake": "Trying to rise on one leg.",
          "fix": "Rise on TWO legs. Only the lowering is single-leg. This is eccentric protocol."
        }
      ],

      "breathing": "Inhale at top, exhale during lowering.",

      "reps": "15 reps per leg, 2-3 sets, daily for tendon rehab.",

      "phase1_notes": "Gold standard for achilles and calf tendon rehab. The slow eccentric loading stimulates tendon remodeling. Part of your daily ankle work."
    },

    "banded_ankle_mobilization": {
      "name": "Banded Ankle Mobilization",
      "aliases": ["banded ankle mob", "ankle mob", "band distraction"],
      "category": "mobility",
      "movement_pattern": "joint_mobilization",
      "equipment": ["resistance_band"],
      "muscles_primary": ["ankle_joint"],
      "muscles_secondary": ["calves"],

      "setup": "Loop heavy band around fixed point at ankle height. Step into band so it wraps around front of ankle. Step forward to create tension.",

      "execution": [
        "Band pulls ankle joint backward. Posterior glide.",
        "Drive knee forward over toes. Into dorsiflexion.",
        "Hold at end range for 15-30 seconds.",
        "Oscillate gently in and out of end range.",
        "Band distraction creates space in joint for movement."
      ],

      "cues": [
        "Band should pull ankle BACK, not up.",
        "Keep heel DOWN on floor.",
        "Drive knee forward AND slightly out.",
        "Gentle oscillations, not forcing."
      ],

      "common_mistakes": [
        {
          "mistake": "Heel lifting off floor.",
          "fix": "Keep heel planted. If it lifts, you're not mobilizing the ankle."
        },
        {
          "mistake": "Band placed too high.",
          "fix": "Band should be at ankle crease, not on shin."
        }
      ],

      "breathing": "Deep, relaxed breathing.",

      "duration": "15-30 seconds per side, 2-3 sets.",

      "phase1_notes": "Key for improving dorsiflexion. If your ankle dorsiflexion is limited, this is how you improve it. Do before any squat work."
    },

    "plantar_fascia_ball_roll": {
      "name": "Plantar Fascia Ball Roll",
      "aliases": ["foot roll", "plantar fascia roll", "ball roll", "arch massage"],
      "category": "rehab",
      "movement_pattern": "self_massage",
      "equipment": ["lacrosse_ball", "golf_ball", "tennis_ball"],
      "muscles_primary": ["plantar_fascia"],
      "muscles_secondary": ["intrinsic_foot_muscles"],

      "setup": "Stand or sit. Place ball under arch of foot.",

      "execution": [
        "Apply moderate pressure through foot onto ball.",
        "Roll ball from heel to toes.",
        "Pause on tender spots for 10-15 seconds.",
        "Cover entire sole. Arch, heel, ball of foot.",
        "60 seconds per foot."
      ],

      "cues": [
        "Moderate pressure. Should feel good pain, not agony.",
        "Slow rolling. Not just skating over surface.",
        "Spend extra time on tight or tender spots.",
        "Breathe and relax into it."
      ],

      "common_mistakes": [
        {
          "mistake": "Too much pressure.",
          "fix": "Back off. Should be uncomfortable but not agonizing."
        },
        {
          "mistake": "Rolling too fast.",
          "fix": "Slow down. Let the ball work into the tissue."
        }
      ],

      "breathing": "Deep, relaxed breathing.",

      "duration": "60 seconds per foot.",

      "phase1_notes": "Daily foot maintenance. Keeps plantar fascia happy. Do first thing in the morning before standing."
    },

    "toe_yoga": {
      "name": "Toe Yoga",
      "aliases": ["toe yoga", "toe lifts", "toe control"],
      "category": "rehab",
      "movement_pattern": "motor_control",
      "equipment": ["none"],
      "muscles_primary": ["intrinsic_foot_muscles"],
      "muscles_secondary": ["toe_flexors", "toe_extensors"],

      "setup": "Barefoot, standing or seated. Feet flat on floor.",

      "execution": [
        "Lift big toe only while pressing other 4 toes into floor.",
        "Then press big toe down and lift other 4 toes.",
        "Alternate back and forth.",
        "Keep foot stationary. Only toes move."
      ],

      "cues": [
        "Isolate the movements. This is harder than it sounds.",
        "Don't let foot roll or move.",
        "Go slowly. It's a motor control exercise."
      ],

      "common_mistakes": [
        {
          "mistake": "Moving whole foot.",
          "fix": "Anchor the foot. Only toes should move."
        },
        {
          "mistake": "Can't isolate big toe.",
          "fix": "Use hand to help initially. Build the neural pathway."
        }
      ],

      "breathing": "Normal breathing.",

      "duration": "30 seconds per foot.",

      "phase1_notes": "Builds foot control and intrinsic muscle strength. Supports ankle stability from the ground up."
    },

    "short_foot_exercise": {
      "name": "Short Foot Exercise",
      "aliases": ["short foot", "foot doming", "arch lift"],
      "category": "rehab",
      "movement_pattern": "isometric_arch_activation",
      "equipment": ["none"],
      "muscles_primary": ["intrinsic_foot_muscles"],
      "muscles_secondary": ["tibialis_posterior"],

      "setup": "Barefoot, standing or seated. Feet flat on floor.",

      "execution": [
        "Keep toes relaxed and flat on floor.",
        "Draw ball of foot toward heel WITHOUT curling toes.",
        "This domes the arch. Shortens the foot.",
        "Hold for 10 seconds.",
        "Release and repeat."
      ],

      "cues": [
        "Toes stay FLAT. No gripping or curling.",
        "Think about shortening your foot.",
        "Arch lifts up, foot gets shorter.",
        "Should feel deep foot muscles working."
      ],

      "common_mistakes": [
        {
          "mistake": "Curling toes to create dome.",
          "fix": "Toes must stay flat and relaxed. The arch lifts from within."
        },
        {
          "mistake": "Can't feel arch working.",
          "fix": "Start seated, foot on towel. Try to gather towel without curling toes."
        }
      ],

      "breathing": "Normal breathing.",

      "duration": "10 second holds, 5 reps per foot.",

      "phase1_notes": "Activates intrinsic foot muscles that support the arch. Foundation for ankle stability. Do daily."
    },

    "calf_stretch_wall": {
      "name": "Wall Calf Stretch",
      "aliases": ["calf stretch", "wall stretch", "gastroc stretch", "runner stretch"],
      "category": "mobility",
      "movement_pattern": "static_stretch",
      "equipment": ["wall"],
      "muscles_primary": ["gastrocnemius"],
      "muscles_secondary": ["soleus", "achilles"],

      "setup": "Face wall, hands on wall at shoulder height. Step one foot back, keeping heel on floor.",

      "execution": [
        "Back leg straight, heel pressed into floor.",
        "Lean into wall, keeping back leg straight.",
        "Feel stretch in upper calf of back leg.",
        "Hold 45-60 seconds.",
        "For soleus: bend back knee slightly while keeping heel down."
      ],

      "cues": [
        "Heel must stay DOWN. No cheating.",
        "Back leg stays STRAIGHT for gastroc.",
        "Lean from ankles, not waist.",
        "Both feet pointing forward."
      ],

      "common_mistakes": [
        {
          "mistake": "Back heel lifting.",
          "fix": "Keep heel down. If it lifts, step closer to wall."
        },
        {
          "mistake": "Back knee bending for gastroc stretch.",
          "fix": "Straight leg targets gastrocnemius. Bent knee targets soleus. Know which you're doing."
        }
      ],

      "breathing": "Deep, relaxed breathing.",

      "duration": "45-60 seconds per leg.",

      "phase1_notes": "Essential for ankle dorsiflexion. Tight calves limit ankle mobility. Do daily, plus after any calf work."
    },

    "thoracic_extension_foam_roller": {
      "name": "Thoracic Extension on Foam Roller",
      "aliases": ["thoracic extension", "t-spine extension", "foam roller extension", "upper back extension"],
      "category": "mobility",
      "movement_pattern": "thoracic_extension",
      "equipment": ["foam_roller"],
      "muscles_primary": ["thoracic_spine"],
      "muscles_secondary": ["pec_minor", "intercostals"],

      "setup": "Lie on foam roller placed horizontally across mid-back. Knees bent, feet flat. Hands behind head to support neck.",

      "execution": [
        "Start with roller at bra-line level. Mid-thoracic.",
        "Let upper back extend over roller. Don't force.",
        "Exhale and relax into extension.",
        "Move roller up slightly, repeat at new segment.",
        "Work from mid-back to upper back."
      ],

      "cues": [
        "Keep butt on floor. No bridging up.",
        "Support head with hands. Don't strain neck.",
        "Extend from mid-back, NOT lower back.",
        "Breathe and relax. Don't fight it."
      ],

      "common_mistakes": [
        {
          "mistake": "Extending from lower back.",
          "fix": "Lower back stays neutral. Only thoracic spine moves. Keep abs engaged."
        },
        {
          "mistake": "Holding breath.",
          "fix": "Exhale into the extension. Breath helps release tension."
        },
        {
          "mistake": "Rolling up and down.",
          "fix": "This isn't rolling. It's targeted extension at each segment. Move roller, then extend."
        }
      ],

      "breathing": "Exhale as you extend over roller.",

      "reps": "5 breaths at each position, 3-4 positions up the spine.",

      "phase1_notes": "Essential for posture and shoulder health. Thoracic stiffness causes shoulder compensation. Do daily in rehab block."
    },

    "chin_tuck": {
      "name": "Chin Tuck",
      "aliases": ["chin tuck", "cervical retraction", "neck reset"],
      "category": "mobility",
      "movement_pattern": "cervical_retraction",
      "equipment": ["none"],
      "muscles_primary": ["deep_neck_flexors"],
      "muscles_secondary": ["cervical_extensors"],

      "setup": "Sitting or standing tall. Shoulders relaxed. Looking straight ahead.",

      "execution": [
        "Draw chin straight BACK. Not down.",
        "Imagine making a double chin.",
        "Head moves back, not tilting.",
        "Hold 5-10 seconds.",
        "Release and repeat."
      ],

      "cues": [
        "Make a double chin. That's the movement.",
        "Head slides back on a shelf. Doesn't tilt.",
        "Gentle stretch at base of skull.",
        "Don't tuck chin to chest. Horizontal movement."
      ],

      "common_mistakes": [
        {
          "mistake": "Looking down.",
          "fix": "Eyes stay level. Head moves horizontally back, not down."
        },
        {
          "mistake": "Lifting chin.",
          "fix": "No extension. Pure retraction. Chin slides back."
        }
      ],

      "breathing": "Normal breathing.",

      "reps": "10 reps, hold each for 5 seconds.",

      "phase1_notes": "Counteracts forward head posture. Do every few hours if you work at a computer. Part of posture reset block."
    },

    "pigeon_stretch": {
      "name": "Pigeon Stretch",
      "aliases": ["pigeon stretch", "pigeon pose", "hip opener", "glute stretch"],
      "category": "mobility",
      "movement_pattern": "static_stretch",
      "equipment": ["mat"],
      "muscles_primary": ["piriformis", "glutes"],
      "muscles_secondary": ["hip_external_rotators"],

      "setup": "Start in all-fours. Bring one knee forward behind same-side wrist. Extend other leg straight back.",

      "execution": [
        "Front shin angled across body. More angle equals more intense.",
        "Back leg extends straight behind.",
        "Square hips toward floor as much as possible.",
        "Stay upright or fold forward over front leg.",
        "Hold for 90 seconds minimum."
      ],

      "cues": [
        "Front shin doesn't need to be parallel to front edge of mat. Angle is individual.",
        "Keep hips square. Don't let back hip rotate open.",
        "Breathe and sink into stretch over time.",
        "Stretch should be in glute and hip of front leg."
      ],

      "common_mistakes": [
        {
          "mistake": "Hip of back leg lifting or rotating.",
          "fix": "Square hips. Use yoga block under front hip if needed for support."
        },
        {
          "mistake": "Pain in front knee.",
          "fix": "Keep front foot flexed to protect knee. Reduce angle of front shin."
        }
      ],

      "breathing": "Deep, relaxed breathing.",

      "duration": "90 seconds per side.",

      "phase1_notes": "Deep glute and hip stretch. Essential cooldown. Hold for full 90 seconds. The magic happens after 60 seconds."
    },

    "lat_stretch": {
      "name": "Lat Stretch",
      "aliases": ["lat stretch", "overhead stretch", "side stretch"],
      "category": "mobility",
      "movement_pattern": "static_stretch",
      "equipment": ["none", "doorframe_or_pole"],
      "muscles_primary": ["latissimus_dorsi"],
      "muscles_secondary": ["teres_major", "obliques"],

      "setup": "Stand next to doorframe or pole. Grab with near hand overhead. Step feet away.",

      "execution": [
        "Grab overhead anchor with one hand.",
        "Step feet away from anchor.",
        "Let body hang sideways. Stretching lat.",
        "Lean hips away from anchor to increase stretch.",
        "Hold 60 seconds."
      ],

      "cues": [
        "Feel stretch along side of back and ribcage.",
        "Push hips AWAY from anchor.",
        "Let shoulder stretch overhead.",
        "Breathe into the stretch."
      ],

      "breathing": "Deep breathing into ribcage.",

      "duration": "60 seconds per side.",

      "phase1_notes": "Essential if your lats are tight. Tight lats affect shoulder overhead motion. Part of cooldown."
    },

    "hamstring_stretch": {
      "name": "Hamstring Stretch",
      "aliases": ["hamstring stretch", "forward fold", "toe touch"],
      "category": "mobility",
      "movement_pattern": "static_stretch",
      "equipment": ["mat", "strap_optional"],
      "muscles_primary": ["hamstrings"],
      "muscles_secondary": ["glutes", "calves"],

      "setup": "Seated on floor. One leg extended, other leg bent with foot against inner thigh of straight leg. Sit tall.",

      "execution": [
        "Hinge at hips. Not waist.",
        "Reach toward foot of extended leg.",
        "Keep back FLAT as you fold. Don't round.",
        "Stop when you feel stretch in back of thigh.",
        "Hold 60 seconds."
      ],

      "cues": [
        "Lead with chest, not head.",
        "Flat back. Don't round to reach further.",
        "Stretch is in hamstring, not lower back.",
        "Use strap around foot if can't reach."
      ],

      "common_mistakes": [
        {
          "mistake": "Rounding back to reach further.",
          "fix": "Keep back flat. Less range with flat back is better than more range with rounded back."
        },
        {
          "mistake": "Bouncing to get deeper.",
          "fix": "Static hold only. Bouncing triggers stretch reflex and reduces effectiveness."
        }
      ],

      "breathing": "Deep, relaxed breathing.",

      "duration": "60 seconds per side.",

      "phase1_notes": "Your hamstring flexibility affects hip hinge quality for RDL. Stretch them after every workout."
    },

    "pec_stretch": {
      "name": "Pec Stretch",
      "aliases": ["pec stretch", "chest stretch", "doorway stretch"],
      "category": "mobility",
      "movement_pattern": "static_stretch",
      "equipment": ["doorframe"],
      "muscles_primary": ["pectoralis_major"],
      "muscles_secondary": ["anterior_deltoid", "biceps"],

      "setup": "Stand in doorway. Place forearm against doorframe, elbow at shoulder height, 90-degree bend in elbow.",

      "execution": [
        "Forearm against doorframe, elbow at shoulder height.",
        "Step through doorway with same-side foot.",
        "Rotate torso AWAY from arm. Feel chest stretch.",
        "Don't lean forward. Stay upright.",
        "Hold 60 seconds."
      ],

      "cues": [
        "Elbow at shoulder height or slightly higher.",
        "Step THROUGH and PAST the doorframe.",
        "Turn body away. Stretch is in chest, not shoulder.",
        "Should feel stretch across chest, not front of shoulder."
      ],

      "common_mistakes": [
        {
          "mistake": "Feeling stretch in front of shoulder only.",
          "fix": "Adjust elbow height and rotation angle. If shoulder hurts, back off."
        },
        {
          "mistake": "Leaning forward.",
          "fix": "Stay upright. Step through further if needed."
        }
      ],

      "breathing": "Deep, relaxed breathing.",

      "duration": "60 seconds per side.",

      "phase1_notes": "Important for shoulder health. Tight pecs pull shoulders forward. Stretch after any pressing work."
    },

    "spine_decompression_hang": {
      "name": "Spine Decompression Hang",
      "aliases": ["dead hang", "spinal hang", "decompression", "bar hang"],
      "category": "mobility",
      "movement_pattern": "traction",
      "equipment": ["pull_up_bar"],
      "muscles_primary": ["grip", "lats"],
      "muscles_secondary": ["spine", "shoulders"],

      "setup": "Grip pull-up bar with overhand grip, shoulder width. Let body hang freely. Feet can touch floor lightly if needed.",

      "execution": [
        "Grip bar firmly.",
        "Let body hang. Allow spine to decompress.",
        "Keep shoulders engaged. Not just hanging from joints.",
        "Relax everything else. Let gravity stretch you.",
        "Hold as long as comfortable."
      ],

      "cues": [
        "Relax your lower body. Let it hang heavy.",
        "Active shoulders. Don't just hang from joints.",
        "Feel space being created between vertebrae.",
        "Breathe deeply and relax."
      ],

      "common_mistakes": [
        {
          "mistake": "Hanging from shoulder joints passively.",
          "fix": "Keep slight shoulder engagement. Think about pulling shoulder blades down slightly."
        },
        {
          "mistake": "Swinging.",
          "fix": "Stay still. The decompression requires stillness."
        }
      ],

      "breathing": "Deep, relaxed breathing.",

      "duration": "30-60 seconds, or accumulate 2-3 minutes total.",

      "phase1_notes": "Great end-of-workout cooldown. Decompresses spine after loaded exercises. Grip work bonus. Be gentle with shoulder. Stop if painful."
    },

    "mcgill_curl_up": {
      "name": "McGill Curl-Up",
      "aliases": ["curl up", "mcgill", "curl-up", "abdominal curl"],
      "category": "core",
      "movement_pattern": "anti_extension",
      "equipment": ["bodyweight"],
      "muscles_primary": ["rectus_abdominis"],
      "muscles_secondary": ["obliques", "transverse_abdominis"],

      "setup": "Lie on back. Bend ONE knee, foot flat on floor. Other leg stays straight. Slide both hands under your lower back, palms down - this monitors your spine position.",

      "execution": [
        "First, BRACE your abs. Imagine bracing for a punch to the stomach - mild tension, not sucking in.",
        "The key: Lift head and shoulders ONLY ONE INCH off the floor. That's it. Tiny movement.",
        "Imagine a bathroom scale under your head and shoulders. Your goal: make it read zero.",
        "Hold 8-10 seconds while breathing normally.",
        "Lower slowly. Switch which leg is bent after each set."
      ],

      "cues": [
        "ONE INCH LIFT. If you're curling up, you've gone too far.",
        "Your back should NOT flatten onto your hands - keep that natural arch.",
        "Eyes stay on ceiling. Don't tuck chin to chest.",
        "Feel your abs engage BEFORE you lift. The bracing IS the exercise."
      ],

      "common_mistakes": [
        {
          "mistake": "Curling too high like a crunch or sit-up.",
          "fix": "TINY movement. One inch only. The tension in your braced abs does the work, not range of motion."
        },
        {
          "mistake": "Tucking chin toward chest.",
          "fix": "Keep an apple-sized gap between chin and chest. Eyes on ceiling, not knees."
        },
        {
          "mistake": "Lower back pressing flat into floor or hands.",
          "fix": "Hands are there to monitor - if back flattens, you've lost neutral spine. Reset and brace before lifting."
        },
        {
          "mistake": "Holding breath during holds.",
          "fix": "Breathe normally throughout. Steady, quiet breathing while maintaining tension."
        }
      ],

      "breathing": "Keep breathing steadily during holds. Quiet, controlled breaths. Never hold your breath.",

      "duration": "8-10 second holds. Start with 6 reps, rest 20 seconds, 4 reps, rest, 2 reps. That's one set.",

      "voice_cue_short": "Brace your abs. Lift head ONE INCH. Hold. Breathe.",

      "phase1_notes": "McGill Big 3 component. This is NOT a crunch - it trains core stability without spinal flexion. If it feels easy, you're probably doing it wrong. Focus on the BRACE, not the lift."
    },

    "clamshells": {
      "name": "Clamshells",
      "aliases": ["clamshell", "clams", "hip abduction", "glute med"],
      "category": "hip",
      "movement_pattern": "hip_abduction",
      "equipment": ["bodyweight", "resistance_band"],
      "muscles_primary": ["gluteus_medius"],
      "muscles_secondary": ["gluteus_minimus", "tensor_fasciae_latae"],
      "per_side": true,

      "setup": "Lie on side. Knees bent 90 degrees, heels together. Head resting on bottom arm. Top hand on hip to monitor pelvis.",

      "execution": [
        "Keep heels glued together throughout.",
        "Rotate top knee up toward ceiling. Hip opens like a clamshell.",
        "Don't let pelvis rock backward as you lift.",
        "Pause briefly at top.",
        "Lower with control. Repeat."
      ],

      "cues": [
        "Heels NEVER separate. Only knees move apart.",
        "Pelvis stays stacked. No rolling backward.",
        "Feel the burn in the side of your hip, not lower back.",
        "RIGHT side priority - do extra set if time (addresses knee valgus)."
      ],

      "common_mistakes": [
        {
          "mistake": "Pelvis rolling backward as knee lifts.",
          "fix": "Hand on hip monitors this. If hip rolls back, you've lost the glute med. Reduce range."
        },
        {
          "mistake": "Heels separating.",
          "fix": "Press heels together firmly. The constraint is what isolates glute med."
        },
        {
          "mistake": "Using momentum or swinging.",
          "fix": "Slow and controlled. 2 seconds up, 2 seconds down. Feel each rep."
        }
      ],

      "breathing": "Exhale as you lift, inhale as you lower.",

      "modifications": {
        "harder": "Add resistance band above knees.",
        "easier": "Reduce range of motion."
      },

      "phase1_notes": "Critical for knee valgus correction. Weak glute med causes knees to cave in during squats. Do daily. RIGHT side gets extra attention for your compensation patterns."
    },

    "side_plank": {
      "name": "Side Plank",
      "aliases": ["side plank", "lateral plank", "mcgill side plank"],
      "category": "core",
      "movement_pattern": "anti_lateral_flexion",
      "equipment": ["bodyweight"],
      "muscles_primary": ["obliques", "quadratus_lumborum"],
      "muscles_secondary": ["gluteus_medius", "transverse_abdominis", "shoulders"],
      "per_side": true,

      "setup": "Lie on side. Elbow DIRECTLY under shoulder. McGill style: STAGGER feet (top foot in front of bottom). Top hand on hip. This is easier on spine than stacked feet.",

      "execution": [
        "Stiffen your core BEFORE lifting. Lock ribcage and pelvis as one unit.",
        "Press elbow into floor, lift hips. Create straight line from head to feet.",
        "Keep hips stacked vertically - don't let them rotate forward or back.",
        "Hold 5-10 seconds. Breathe steadily.",
        "Lower with control. Rest. Repeat. Switch sides."
      ],

      "cues": [
        "STIFFNESS before movement. Brace core, then lift.",
        "Push the ground AWAY through your elbow. Active shoulder.",
        "Straight line from head to feet. No sagging, no piking.",
        "Squeeze glutes. They're the secret to stable hips."
      ],

      "common_mistakes": [
        {
          "mistake": "Hips sagging toward floor.",
          "fix": "Squeeze glutes AND push floor away. If it sags, shorten the hold and reset."
        },
        {
          "mistake": "Hips piking up (butt in the air).",
          "fix": "Straight line, not a tent. Lower hips until body is one straight plank."
        },
        {
          "mistake": "Shoulder creeping toward ear.",
          "fix": "Pack the shoulder - draw it DOWN and back. Create space between ear and shoulder."
        },
        {
          "mistake": "Holding breath.",
          "fix": "Quiet, steady breathing throughout. Breath-holding defeats the purpose."
        }
      ],

      "breathing": "Steady, quiet breathing. Never hold your breath.",

      "duration": "McGill protocol: 5-10 second holds, 5 reps per side. Quality over duration.",

      "modifications": {
        "easier": "Knee-down side plank: bottom knee bent, lift from knee not feet.",
        "harder": "Straight arms instead of elbow. Or add top leg raise while holding."
      },

      "voice_cue_short": "Stiffen core. Push floor away. Straight line. Squeeze glutes.",

      "phase1_notes": "McGill Big 3 component. Trains lateral stability critical for back health. Non-negotiable for spine protection. Do both sides equally."
    },

    "inverted_row": {
      "name": "Inverted Row",
      "aliases": ["inverted row", "body row", "australian pull-up", "horizontal row", "trx row"],
      "category": "upper_body_pull",
      "movement_pattern": "horizontal_pull",
      "equipment": ["trx", "bar", "rings", "smith_machine"],
      "muscles_primary": ["lats", "rhomboids", "middle_traps"],
      "muscles_secondary": ["biceps", "rear_delts", "core"],

      "setup": "Grip bar or handles at chest height. Walk feet forward until body is at angle. Arms straight, body in straight line from head to heels.",

      "execution": [
        "Initiate by squeezing shoulder blades together.",
        "Pull chest toward bar or handles.",
        "Keep body rigid like a plank throughout.",
        "Touch chest to bar if possible.",
        "Lower with control back to start."
      ],

      "cues": [
        "Squeeze shoulder blades FIRST, then pull with arms.",
        "Body stays rigid. No sagging hips or piking.",
        "Pull to chest level, not stomach.",
        "Keep elbows at 45 degrees, not flared out."
      ],

      "common_mistakes": [
        {
          "mistake": "Hips sagging or dropping.",
          "fix": "Squeeze glutes and brace core. Body is a rigid plank."
        },
        {
          "mistake": "Only pulling with arms.",
          "fix": "Start with shoulder blade retraction. Arms follow the back."
        },
        {
          "mistake": "Neck craning forward.",
          "fix": "Keep neck neutral. Don't lead with chin."
        }
      ],

      "breathing": "Exhale as you pull up, inhale as you lower.",

      "modifications": {
        "easier": "Walk feet less forward (more vertical body angle). Or bend knees.",
        "harder": "Elevate feet on bench. Add pause at top. Slow eccentric."
      },

      "phase1_notes": "Horizontal pulling without vertical load on shoulder. Perfect for building back strength while protecting rotator cuff. Addresses back pulling volume gap in Phase 1."
    },

    "lateral_band_walks": {
      "name": "Lateral Band Walks",
      "aliases": ["band walks", "monster walks", "side steps", "lateral walks", "x-band walks"],
      "category": "hip",
      "movement_pattern": "hip_abduction",
      "equipment": ["resistance_band"],
      "muscles_primary": ["gluteus_medius", "gluteus_minimus"],
      "muscles_secondary": ["tensor_fasciae_latae", "quadriceps"],
      "per_side": true,
      "per_direction": true,

      "setup": "Place band above knees (not on kneecaps). Feet hip-width apart. Quarter squat position. Hands on hips or in front.",

      "execution": [
        "Maintain quarter squat throughout. Don't stand up.",
        "Step sideways. Lead with one foot, other follows.",
        "Keep tension on band always. Never let feet come together.",
        "Take 10 steps one direction, then 10 steps back.",
        "Stay low. Feel the burn in outer hip."
      ],

      "cues": [
        "Push knees OUT against band. Never let them cave.",
        "Stay in the squat. Standing up is cheating.",
        "Smooth controlled steps. No bouncing or shuffling.",
        "Burn in glute med is the goal. If you feel quads only, go lower."
      ],

      "common_mistakes": [
        {
          "mistake": "Standing up between steps.",
          "fix": "Stay in quarter squat the entire time. That's where glute med works."
        },
        {
          "mistake": "Knees caving inward.",
          "fix": "Actively push knees OUT against band. This is the point of the exercise."
        },
        {
          "mistake": "Taking huge steps and losing tension.",
          "fix": "Small controlled steps. Band stays taut throughout."
        }
      ],

      "breathing": "Steady breathing throughout.",

      "modifications": {
        "easier": "Higher squat position. Lighter band.",
        "harder": "Lower squat. Heavier band. Or move band to ankles."
      },

      "phase1_notes": "Critical for fixing knee valgus pattern. The band forces you to fight the exact compensation you need to fix. Do before squats and lunges as activation. Essential for your 4cm ankle deficit compensation fix."
    },

    "single_leg_rdl": {
      "name": "Single-Leg RDL",
      "aliases": ["single leg deadlift", "one leg rdl", "sl rdl", "single leg romanian deadlift"],
      "category": "lower_body",
      "movement_pattern": "hip_hinge",
      "equipment": ["dumbbell", "kettlebell", "bodyweight"],
      "muscles_primary": ["hamstrings", "glutes"],
      "muscles_secondary": ["erector_spinae", "core", "ankle_stabilizers"],
      "per_side": true,

      "setup": "Stand on one leg. Light weight in opposite hand (or same hand - debate exists). Standing knee slightly bent, not locked.",

      "execution": [
        "Hinge at hip. Chest tips forward as back leg extends behind.",
        "Keep back flat. Don't round.",
        "Standing leg stays slightly bent throughout.",
        "Lower until you feel hamstring stretch or torso is parallel to floor.",
        "Drive through heel to return to standing."
      ],

      "cues": [
        "Hip hinge, not squat. Push hip BACK.",
        "Back leg is counterbalance. It extends as you hinge.",
        "Standing knee stays pushed slightly OUT. Don't let it cave.",
        "Weight stays close to body. Not reaching forward."
      ],

      "common_mistakes": [
        {
          "mistake": "Rounding lower back.",
          "fix": "Only go as low as you can with flat back. Hamstring flexibility limits range."
        },
        {
          "mistake": "Standing knee caving inward.",
          "fix": "Actively push knee OUT. This is critical for your ankle compensation pattern."
        },
        {
          "mistake": "Spinning open or twisting.",
          "fix": "Keep hips square to floor. Both hip bones point down."
        }
      ],

      "breathing": "Inhale as you hinge down, exhale as you drive up.",

      "modifications": {
        "easier": "Touch wall or hold chair for balance. Or touch back toe down lightly.",
        "harder": "Add weight. Pause at bottom. Slow tempo."
      },

      "phase1_notes": "RIGHT leg standing gets priority - addresses your ankle compensation patterns. Start bodyweight or very light. Focus on balance and hip hinge pattern. Great for ankle stability and proprioception."
    },

    "suitcase_carry": {
      "name": "Suitcase Carry",
      "aliases": ["suitcase carry", "single arm farmers walk", "offset carry", "unilateral carry"],
      "category": "functional",
      "movement_pattern": "loaded_carry",
      "equipment": ["dumbbell", "kettlebell"],
      "muscles_primary": ["obliques", "quadratus_lumborum"],
      "muscles_secondary": ["grip", "traps", "core", "glutes"],

      "setup": "Heavy weight in one hand at side. Stand tall. Shoulders level - don't lean toward or away from weight.",

      "execution": [
        "Walk forward with normal stride.",
        "Keep shoulders perfectly level. Don't lean.",
        "Core braced throughout. This is anti-lateral flexion work.",
        "Walk prescribed distance or time.",
        "Switch hands and repeat."
      ],

      "cues": [
        "Shoulders LEVEL. Imagine balancing a tray on your head.",
        "Don't lean away from weight to compensate.",
        "Core is fighting to stay upright. That's the point.",
        "Walk normally. Don't waddle or take weird steps."
      ],

      "common_mistakes": [
        {
          "mistake": "Leaning away from the weight.",
          "fix": "That's cheating the core work. Stay vertical. Use mirror to check."
        },
        {
          "mistake": "Shrugging shoulder on weighted side.",
          "fix": "Keep shoulder DOWN and back. Pack the shoulder."
        },
        {
          "mistake": "Holding breath.",
          "fix": "Breathe normally throughout. Core bracing doesn't require breath holding."
        }
      ],

      "breathing": "Normal breathing. Don't hold breath.",

      "distance": "30 meters or 30 seconds per side.",

      "phase1_notes": "Functional anti-lateral flexion. Trains the body to resist being pulled to one side. Great for posture and back health. Go heavy - this is strength work."
    },

    "neck_harness": {
      "name": "Neck Harness Training",
      "aliases": ["neck harness", "neck exercise", "neck training", "neck flexion extension"],
      "category": "neck",
      "movement_pattern": "flexion_extension",
      "equipment": ["neck_harness", "weight_plate"],
      "muscles_primary": ["sternocleidomastoid", "splenius", "trapezius"],
      "muscles_secondary": ["levator_scapulae", "scalenes"],

      "setup": "Seated on bench or standing bent over. Neck harness secured on head. Light weight attached.",

      "execution": [
        "For flexion: Tuck chin, look at floor. Control the movement.",
        "For extension: Look up toward ceiling. Full range.",
        "Move through full range of motion slowly.",
        "15 reps each direction per set.",
        "Control the weight. Never jerk or bounce."
      ],

      "cues": [
        "START LIGHT. Neck is sensitive. Ego has no place here.",
        "Slow controlled reps. 2 seconds each direction.",
        "Full range but not forced.",
        "If any pain, stop immediately."
      ],

      "common_mistakes": [
        {
          "mistake": "Going too heavy too fast.",
          "fix": "Start with 2.5kg. Progress slowly over weeks. Neck adapts slowly."
        },
        {
          "mistake": "Jerky movements.",
          "fix": "Smooth and controlled. Never ballistic movements with neck."
        },
        {
          "mistake": "Skipping this exercise.",
          "fix": "Blueprint standard for longevity. Strong neck protects brain from impacts. Worth the awkward looks."
        }
      ],

      "breathing": "Normal breathing throughout.",

      "frequency": "2x per week. Not daily.",

      "phase1_notes": "Bryan Johnson Blueprint standard. Start VERY light - 2.5kg max first few weeks. Strong neck reduces concussion risk and improves posture. Progress slowly."
    },

    "side_lying_wiper": {
      "name": "Side-Lying Wiper (Eccentric Focus)",
      "aliases": ["side lying wiper", "wiper exercise", "eccentric wiper", "shoulder wiper", "eccentric rotator cuff"],
      "category": "shoulder_rehab",
      "movement_pattern": "external_rotation",
      "equipment": ["light_dumbbell", "mat"],
      "muscles_primary": ["infraspinatus", "teres_minor", "supraspinatus"],
      "muscles_secondary": ["deltoids", "rotator_cuff"],

      "setup": "Side-lying on bench or floor. Bottom arm propped under head. Top arm at 90 degrees at elbow, upper arm parallel to floor.",

      "execution": [
        "CONCENTRIC: Use other hand to help lift the weight up to vertical.",
        "ECCENTRIC: Lower the weight DOWN slowly, 4 seconds minimum.",
        "Control the descent. This is where healing happens.",
        "At bottom, forearm is parallel to floor. Full stretch.",
        "Help it back up. Repeat. Eccentric is the focus."
      ],

      "cues": [
        "THE HEALER. This exercise is gold for rotator cuff rehab.",
        "Use LIGHT weight - 1-2kg max. Not about strength here.",
        "4 seconds on the way DOWN. Slow is the key.",
        "Feel the stretch at the bottom. Control it.",
        "Elbow stays glued to side throughout."
      ],

      "common_mistakes": [
        {
          "mistake": "Going too heavy.",
          "fix": "1-2kg MAX. This is rehab, not strength training. Ego aside."
        },
        {
          "mistake": "Dropping the weight too fast.",
          "fix": "4 seconds DOWN. The eccentric loading is where collagen remodeling happens."
        },
        {
          "mistake": "Elbow floating away from body.",
          "fix": "Keep elbow tucked at 90 degrees. Upper arm parallel to floor."
        }
      ],

      "breathing": "Exhale on the way down. Stay relaxed.",

      "voice_cue_short": "Light weight, 1-2kg. Help it up, lower it slow - 4 seconds. Feel the stretch.",

      "phase1_notes": "Critical shoulder rehab exercise. Eccentric loading promotes collagen synthesis in damaged tendons. Do this consistently - it's medicine."
    },

    "sumo_deadlift": {
      "name": "Sumo Deadlift (Dumbbell/Kettlebell)",
      "aliases": ["sumo deadlift", "sumo dead", "wide stance deadlift", "sumo dl", "sumo kb deadlift", "sumo dumbbell deadlift"],
      "category": "lower_body",
      "movement_pattern": "hip_hinge",
      "equipment": ["dumbbell", "kettlebell"],
      "muscles_primary": ["glutes", "quadriceps", "adductors", "hamstrings"],
      "muscles_secondary": ["erector_spinae", "core", "traps"],

      "setup": "Wide stance - 1.5x shoulder width. Toes pointed out 45 degrees. DB or KB between feet. Chest up, hips back.",

      "execution": [
        "Big breath, brace core hard.",
        "Push knees OUT in line with toes. Don't let them cave.",
        "Drive through whole foot - heels AND balls of feet.",
        "Keep torso more upright than conventional deadlift.",
        "Stand tall, squeeze glutes at top. Full hip extension."
      ],

      "cues": [
        "Spread the floor with your feet. Creates tension.",
        "Chest UP. This isn't an RDL - stay more upright.",
        "Knees out, knees out, knees out. The mantra.",
        "Arms are just hooks. Legs do all the work."
      ],

      "common_mistakes": [
        {
          "mistake": "Knees cave inward.",
          "fix": "Actively push knees OUT over toes. Spread the floor."
        },
        {
          "mistake": "Hips shoot up first, back rounds.",
          "fix": "Chest and hips rise together. Don't turn it into a stiff-leg."
        },
        {
          "mistake": "Weight too far from body.",
          "fix": "Keep DB/KB close to body. It should graze your legs on the way up."
        }
      ],

      "breathing": "Big breath at bottom, hold through lift, exhale at top.",

      "voice_cue_short": "Wide stance, toes out. Knees OUT over toes. Chest stays up. Squeeze glutes at top.",

      "phase1_notes": "Great trap bar alternative with DB/KB. More upright torso = less lower back stress. Heavy compound lift - progress weight weekly. Wider stance hits adductors and glutes hard."
    },

    "turkish_getup": {
      "name": "Turkish Get-Up",
      "aliases": ["tgu", "turkish getup", "get up", "turkish"],
      "category": "full_body",
      "movement_pattern": "ground_to_standing",
      "equipment": ["kettlebell", "dumbbell"],
      "muscles_primary": ["shoulders", "core", "glutes", "hip_flexors"],
      "muscles_secondary": ["triceps", "chest", "lats", "quadriceps"],

      "setup": "Lying on back, kettlebell pressed to ceiling with one arm. Same-side knee bent, foot flat on floor. Other arm at 45 degrees.",

      "execution": [
        "Eyes on the bell the entire time. Never look away.",
        "Roll to elbow, then to hand (posting arm).",
        "Hip bridge, sweep back leg through to kneeling.",
        "Windmill up to tall kneeling.",
        "Stand up. Reverse the entire sequence to get back down."
      ],

      "cues": [
        "Eyes locked on bell. Always.",
        "Move slow. This isn't a race.",
        "Each position is a checkpoint. Pause. Own it.",
        "Shoulder stays packed. Bell stays over shoulder."
      ],

      "common_mistakes": [
        {
          "mistake": "Looking away from the bell.",
          "fix": "Eyes on bell means bell position awareness. Safety first."
        },
        {
          "mistake": "Rushing through transitions.",
          "fix": "Each position is a plank. Hold it. Own it. Then move."
        },
        {
          "mistake": "Bent elbow on the overhead arm.",
          "fix": "Elbow LOCKED. Pack shoulder. Straight arm or the weight falls on you."
        }
      ],

      "breathing": "Breathe at each checkpoint. Don't hold breath through entire movement.",

      "voice_cue_short": "Eyes on bell always. Each position is a checkpoint. Slow and controlled.",

      "phase1_notes": "Full-body diagnostic exercise. If you can do a smooth TGU, most things are working. Start LIGHT - technique before load."
    },

    "kb_clean_press": {
      "name": "Kettlebell Clean & Press",
      "aliases": ["kb clean press", "clean and press", "kettlebell clean and press", "clean press"],
      "category": "full_body",
      "movement_pattern": "power_push",
      "equipment": ["kettlebell"],
      "muscles_primary": ["shoulders", "triceps", "core", "hips"],
      "muscles_secondary": ["forearms", "lats", "glutes"],

      "setup": "Kettlebell on floor in front. Feet hip-width. Hinge down to grip with one hand.",

      "execution": [
        "CLEAN: Hike the bell back, then drive hips forward to clean to rack position.",
        "Rack: Bell rests on forearm, elbow tight to ribs, wrist straight.",
        "PRESS: Brace core, press bell overhead. Lock out elbow at top.",
        "Lower with control back to rack, then drop/hike to start."
      ],

      "cues": [
        "Clean is a hip drive, not an arm curl.",
        "Rack position: elbow tight to ribs, bell on forearm.",
        "Press from the lats. Don't flare elbow.",
        "Full lockout overhead. Bicep by ear."
      ],

      "common_mistakes": [
        {
          "mistake": "Bell bangs forearm during clean.",
          "fix": "Insert hand early, guide bell around - don't let it flip and crash."
        },
        {
          "mistake": "Using arm to clean instead of hips.",
          "fix": "It's a hip snap. Arm just guides the bell."
        },
        {
          "mistake": "Pressing forward instead of straight up.",
          "fix": "Bell path goes straight up. Move your head out of the way, not the bell."
        }
      ],

      "breathing": "Exhale on clean, breath at rack, exhale on press.",

      "voice_cue_short": "Hip snap for clean. Rack tight. Press from lats. Full lockout.",

      "phase1_notes": "Great power developer. Clean technique is crucial - don't let the bell bang your wrist."
    },

    "ankle_alphabet": {
      "name": "Ankle Alphabet",
      "aliases": ["ankle abc", "alphabet ankle", "ankle circles alphabet"],
      "category": "mobility",
      "movement_pattern": "circular",
      "equipment": ["none"],
      "muscles_primary": ["tibialis_anterior", "peroneals", "calf_muscles"],
      "muscles_secondary": ["intrinsic_foot_muscles"],

      "setup": "Seated or lying down with leg extended. Foot off the ground.",

      "execution": [
        "Using your big toe as a pen, trace the letters A through Z.",
        "Full range of motion on each letter.",
        "Move through ankle, not knee or hip.",
        "Take your time - quality over speed."
      ],

      "cues": [
        "Big toe is the pen. Draw clearly.",
        "Full range on each letter. Capital letters.",
        "Ankle moves, not knee or leg.",
        "Priority on injured ankle - extra attention there."
      ],

      "common_mistakes": [
        {
          "mistake": "Rushing through alphabet.",
          "fix": "Slow down. Each letter should be recognizable."
        },
        {
          "mistake": "Moving whole leg instead of just ankle.",
          "fix": "Isolate the ankle. Knee stays still."
        },
        {
          "mistake": "Skipping letters or making them small.",
          "fix": "Full range. Maximize the mobility work."
        }
      ],

      "breathing": "Normal breathing throughout.",

      "voice_cue_short": "Big toe is a pen. Draw A to Z. Full range. Ankle only.",

      "phase1_notes": "Classic ankle mobility drill. Especially important for ankle recovery. Does both dorsiflexion and inversion/eversion in one exercise."
    }
  },

  "quick_reference": {
    "shoulder_safe_pressing": "Neutral grip floor press with 45-degree elbow angle.",
    "shoulder_rehab_priority": ["side_lying_external_rotation", "face_pull", "band_pull_apart", "scapular_wall_slide"],
    "ankle_rehab_priority": ["single_leg_balance", "heel_raises", "ankle_cars", "eccentric_calf_raises"],
    "ankle_mobility_help": "Elevate heels for goblet squats and split squats if dorsiflexion limited.",
    "gate_1_exercises": ["single_leg_balance", "heel_raises"],
    "daily_non_negotiables": ["cat_cow", "single_leg_balance", "plantar_fascia_ball_roll", "shoulder_rehab_block"],
    "warmup_sequence": ["cat_cow", "worlds_greatest_stretch", "glute_bridge", "band_pull_apart", "bodyweight_squat"]
  },

  "voice_response_format": {
    "short": "{name}. {setup} Key cues: {cues[0:2]}. Watch out: {common_mistakes[0].mistake}",
    "medium": "{name}. {setup} Execution: {execution[0:3]}. Key cues: {cues[0:3]}. Common mistake: {common_mistakes[0].mistake}. Fix: {common_mistakes[0].fix}",
    "full": "Return all fields formatted for voice."
  }
}
